export const airportCities: Record<string, string[]> = {
  TPE: ['台北市', '新北市', '桃園市', '基隆市', '新竹市', '新竹縣'],
  TSA: ['台北市', '新北市'],
  KHH: ['高雄市', '屏東縣', '台南市'],
  RMQ: ['台中市', '彰化縣', '南投縣'],
};

export const cityDistricts: Record<string, string[]> = {
  '台北市': ['中正區', '大同區', '中山區', '松山區', '大安區', '萬華區', '信義區', '士林區', '北投區', '內湖區', '南港區', '文山區'],
  '新北市': ['板橋區', '三重區', '中和區', '永和區', '新莊區', '新店區', '土城區', '蘆洲區', '汐止區', '樹林區', '淡水區', '三峽區', '林口區', '五股區', '泰山區'],
  '桃園市': ['桃園區', '中壢區', '大溪區', '楊梅區', '蘆竹區', '龜山區', '八德區', '大園區', '平鎮區'],
  '高雄市': ['前鎮區', '苓雅區', '左營區', '三民區', '鳳山區', '小港區', '楠梓區', '鼓山區', '新興區', '前金區'],
  '台中市': ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '豐原區'],
  '基隆市': ['仁愛區', '信義區', '中正區', '中山區', '安樂區', '暖暖區', '七堵區'],
  '新竹市': ['東區', '北區', '香山區'],
  '新竹縣': ['竹北市', '竹東鎮', '新埔鎮', '湖口鄉', '新豐鄉'],
  '屏東縣': ['屏東市', '潮州鎮', '東港鎮', '萬丹鄉', '長治鄉'],
  '台南市': ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '新營區'],
  '彰化縣': ['彰化市', '員林市', '鹿港鎮', '和美鎮', '溪湖鎮'],
  '南投縣': ['南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮'],
};
